[
  {
    "definition": "a die face marked with one spot",
    "examples": []
  },
  {
    "definition": "a playing card marked in its center with one pip",
    "examples": []
  },
  {
    "definition": "a domino end marked with one spot",
    "examples": []
  },
  {
    "definition": "a very small amount or degree : particle",
    "examples": []
  },
  {
    "definition": "a point scored especially on a service (as in tennis or handball) that an opponent fails to touch",
    "examples": []
  },
  {
    "definition": "a golf score of one stroke on a hole, a hole made in one stroke",
    "examples": []
  },
  {
    "definition": "a combat pilot who has brought down at least five enemy airplanes",
    "examples": []
  },
  {
    "definition": "a person who excels at something",
    "examples": [
      "a computer ace"
    ]
  },
  {
    "definition": "the best pitcher on a baseball team",
    "examples": [
      "the ace of the staff"
    ]
  },
  {
    "definition": "an ace dealt face down to a player (as in stud poker) and not exposed until the showdown",
    "examples": []
  },
  {
    "definition": "an effective and decisive argument or resource held in reserve",
    "examples": []
  },
  {
    "definition": "on the point of : very near to",
    "examples": [
      "came within an ace of winning"
    ]
  },
  {
    "definition": "to score an ace against (an opponent)",
    "examples": []
  },
  {
    "definition": "to make (a hole in golf) in one stroke",
    "examples": []
  },
  {
    "definition": "to gain a decisive advantage over : defeat",
    "examples": []
  },
  {
    "definition": "to earn a high grade on (something, such as an examination), to get an A on",
    "examples": []
  },
  {
    "definition": "to perform extremely well in",
    "examples": [
      "he aced every subject"
    ]
  },
  {
    "definition": "of first or high rank or quality",
    "examples": [
      "an ace mechanic"
    ]
  },
  {
    "definition": "an asexual person (see asexual sense 3b)",
    "examples": [
      "Like many other aces and aros, I grew up thinking I was broken. I was 19 before I heard the words \"asexual\" or \"aromantic,\" before I found out that there were other people in the world like me.",
      "— Mikayla Micomonaco"
    ]
  },
  {
    "definition": "asexual",
    "examples": [
      "But ace individuals often still feel romantic attraction toward others, as well as a drive to cultivate intimate, loving relationships—just without an intrinsic interest in pursuing the sexual aspect.",
      "— Taryn Deoilers"
    ]
  },
  {
    "definition": "used for a bandage with elastic properties",
    "examples": []
  },
  {
    "definition": "American Council on Education",
    "examples": []
  },
  {
    "definition": "angiotensin converting enzyme",
    "examples": [
      "The ACE inhibitors are designer molecules developed specifically to attach to their target enzyme and prevent it from activating angiotensin. Virtually the only thing these drugs do in the body is to interact with ACE. However, ACE is not a very specific enzyme; it acts on hormones besides angiotensin.",
      "— Harvard Medical Health Letter"
    ]
  }
]