[
  {
    "definition": "a container used to remove water from a boat",
    "examples": []
  },
  {
    "definition": "to clear (water) from a boat by dipping and throwing over the side",
    "examples": [
      "bailing water out of the boat"
    ]
  },
  {
    "definition": "to clear water from by dipping and throwing",
    "examples": [
      "had to start bailing out the rowboat"
    ]
  },
  {
    "definition": "bail out sense 2",
    "examples": [
      "You can\u0027t say he has ever bailed when things got tough, because that\u0027s just not true.",
      "— Richard Hoffer",
      "Before the party moved elsewhere, I bailed, exhausted.",
      "— Steve Hirdt"
    ]
  },
  {
    "definition": "the temporary release of a prisoner in exchange for security (see security sense 2a) given for the prisoner\u0027s appearance at a later hearing",
    "examples": [
      "being held without bail",
      "The suspect is now out on bail."
    ]
  },
  {
    "definition": "security given for the release of a prisoner on bail",
    "examples": [
      "Bail was set at $300,000.",
      "a motion to reduce bail"
    ]
  },
  {
    "definition": "one who provides bail",
    "examples": []
  },
  {
    "definition": "to temporarily release (a prisoner) in exchange for security (see security sense 2a) given for appearance at a later hearing : to release under bail (see bail entry 3 sense 1)",
    "examples": []
  },
  {
    "definition": "to procure the release of by giving bail (see bail entry 3 sense 2)",
    "examples": [
      "Her lawyer bailed her out of jail."
    ]
  },
  {
    "definition": "to help from a predicament",
    "examples": [
      "His parents are always bailing him out of trouble.",
      "bail out impoverished countries"
    ]
  },
  {
    "definition": "a U-shaped strip used to support something (such as the cover of a wagon or the canopy of a small boat)",
    "examples": []
  },
  {
    "definition": "a hinged bar for holding paper against the platen of a typewriter",
    "examples": []
  },
  {
    "definition": "a usually arched handle (as of a kettle or pail)",
    "examples": []
  },
  {
    "definition": "to deliver (personal property) in trust to another for a special purpose and for a limited period",
    "examples": []
  },
  {
    "definition": "a device for confining or separating animals",
    "examples": []
  }
]