[
  {
    "definition": "to make the characteristic short loud cry of a dog",
    "examples": []
  },
  {
    "definition": "to make a noise resembling a bark",
    "examples": []
  },
  {
    "definition": "to speak in a curt loud and usually angry tone : snap",
    "examples": []
  },
  {
    "definition": "to produce a usually sharp, sudden pain",
    "examples": [
      "… at 36 and with his mustache turning gray and his body barking back in pain, Luis DeLeon is in spring training with the Cubs.",
      "— Joseph A. Reaves",
      "The shoulder is pain-free for now, but his elbow barks at him occasionally …",
      "— Mike Lupica"
    ]
  },
  {
    "definition": "to utter in a curt loud usually angry tone",
    "examples": [
      "an officer barking orders"
    ]
  },
  {
    "definition": "to advertise by persistent outcry",
    "examples": [
      "barking their wares"
    ]
  },
  {
    "definition": "to promote or follow a mistaken course (as in doing research)",
    "examples": []
  },
  {
    "definition": "the sound made by a barking dog",
    "examples": []
  },
  {
    "definition": "a similar sound",
    "examples": []
  },
  {
    "definition": "a short sharp peremptory tone of speech or utterance",
    "examples": []
  },
  {
    "definition": "used to say that someone known for harsh or angry speech does not actually treat others in an unfairly harsh or harmful way",
    "examples": [
      "Chairman Paul Millership was larger than life and shouted his orders loud and clear. But his bark was worse than his bite and he was scrupulously fair to employees who put in the effort.",
      "— The Nottingham Evening Post"
    ]
  },
  {
    "definition": "the tough exterior covering of a woody root or stem, the tissues outside the cambium that include an inner layer especially of secondary phloem and an outer layer of periderm",
    "examples": []
  },
  {
    "definition": "cinchona sense 2",
    "examples": []
  },
  {
    "definition": "a candy containing chocolate and nuts that is made in a sheet and broken into pieces",
    "examples": []
  },
  {
    "definition": "to treat with an infusion of tanbark",
    "examples": []
  },
  {
    "definition": "to strip the bark from",
    "examples": []
  },
  {
    "definition": "to rub off or abrade the skin of",
    "examples": [
      "barked a shin on the desk"
    ]
  },
  {
    "definition": "a small sailing ship",
    "examples": []
  },
  {
    "definition": "a sailing ship of three or more masts with the aftmost mast fore-and-aft rigged and the others square-rigged",
    "examples": []
  },
  {
    "definition": "a craft propelled by sails or oars",
    "examples": []
  }
]