[
  {
    "definition": "a long piece of heavy often squared timber suitable for use in construction",
    "examples": []
  },
  {
    "definition": "a wood or metal cylinder in a loom on which the warp (see warp entry 1 sense 1a) is wound",
    "examples": []
  },
  {
    "definition": "the part of a plow to which handles, standard, and coulter are attached",
    "examples": []
  },
  {
    "definition": "the bar of a balance from which scales hang",
    "examples": []
  },
  {
    "definition": "one of the principal horizontal supporting members (as of a building or ship), boom, spar",
    "examples": [
      "a steel beam supporting a floor",
      "the beam of a crane"
    ]
  },
  {
    "definition": "the extreme width of a ship at the widest part",
    "examples": []
  },
  {
    "definition": "an oscillating lever on a central axis receiving motion at one end from an engine connecting rod and transmitting it at the other",
    "examples": []
  },
  {
    "definition": "a ray or shaft of light",
    "examples": [
      "beams from the searchlights"
    ]
  },
  {
    "definition": "a collection of nearly parallel rays (such as X-rays) or a stream of particles (such as electrons)",
    "examples": []
  },
  {
    "definition": "a constant directional radio signal transmitted for the guidance of pilots, the course indicated by a radio beam",
    "examples": []
  },
  {
    "definition": "the main stem of a deer\u0027s antler",
    "examples": []
  },
  {
    "definition": "the width of the buttocks",
    "examples": [
      "… immensely broad in the beam …",
      "— Ann Bridge"
    ]
  },
  {
    "definition": "following a guiding beam",
    "examples": []
  },
  {
    "definition": "proceeding or operating correctly",
    "examples": []
  },
  {
    "definition": "to emit in beams or as a beam (see beam entry 1 sense 2)",
    "examples": [
      "The sun beamed its light through the window."
    ]
  },
  {
    "definition": "to support with beams (see beam entry 1 sense 1)",
    "examples": [
      "The house was beamed with heavy timbers."
    ]
  },
  {
    "definition": "to transmit especially by satellite : broadcast",
    "examples": [
      "… the 90-minute show was beamed to more than 200 countries and territories around the world.",
      "— TV Guide"
    ]
  },
  {
    "definition": "to transmit (data) electronically, to transmit (data) wirelessly",
    "examples": [
      "beaming images of the planet back to Earth",
      "The amount of data beamed over fiber-optic networks is rising exponentially every year, yet only 0.1% of fiber capacity is in use.",
      "— Leslie Cauley",
      "Infrared connectivity enables users to work collaboratively on documents without having to log on to the network, and for quickly \"beaming\" data between different devices (for example, between two notebooks, or between a notebook and a printer, without a need for a cable).",
      "— Newsweek"
    ]
  },
  {
    "definition": "to direct to a particular audience",
    "examples": [
      "a commercial beamed at middle-class voters"
    ]
  },
  {
    "definition": "to send out rays of light",
    "examples": [
      "Sunlight beamed through the window."
    ]
  },
  {
    "definition": "to smile with joy",
    "examples": [
      "The bride was beaming."
    ]
  }
]