[
  {
    "definition": "to speak in a loud distinct voice so as to be heard at a distance : shout",
    "examples": [
      "call for help"
    ]
  },
  {
    "definition": "to make a request or demand",
    "examples": [
      "call for an investigation"
    ]
  },
  {
    "definition": "to utter a characteristic note or cry",
    "examples": []
  },
  {
    "definition": "to speak to or attempt to reach someone by means of a call (see call entry 2 sense 8)",
    "examples": [
      "just called to say hello",
      "I call once a week to talk to my parents.",
      "Several weeks later our son\u0027s family called to FaceTime with us.",
      "— Daily Reporter (Greenfield, IN)",
      "She called up and asked if we wanted to come over for dinner."
    ]
  },
  {
    "definition": "to make a demand in card games (as for a particular card or for a show of hands)",
    "examples": []
  },
  {
    "definition": "to give the calls for a square dance",
    "examples": []
  },
  {
    "definition": "to make a brief visit",
    "examples": [
      "called to pay his respects",
      "called on a friend"
    ]
  },
  {
    "definition": "to utter in a loud distinct voice, to announce or read loudly or authoritatively, to announce the play-by-play of (a sports event, such as a football game)",
    "examples": [
      "call out a number",
      "call the roll",
      "call off a row of figures"
    ]
  },
  {
    "definition": "to command or request to come or be present, to cause to come : bring",
    "examples": [
      "was called to testify",
      "calls to mind an old saying"
    ]
  },
  {
    "definition": "to summon to a particular activity, employment, or office",
    "examples": [
      "was called to active duty",
      "was called to the bar of justice"
    ]
  },
  {
    "definition": "to invite or command to meet : convoke",
    "examples": [
      "call a meeting"
    ]
  },
  {
    "definition": "to rouse from sleep or summon to get up",
    "examples": []
  },
  {
    "definition": "to give the order for : bring into action, to manage by giving the signals or orders",
    "examples": [
      "call a strike against the company",
      "call a pitchout",
      "that catcher calls a good game"
    ]
  },
  {
    "definition": "to make a demand in bridge for (a card or suit), to require (a player) to show the hand in poker by making an equal bet, to challenge to make good on a statement, to charge with or censure for an offense",
    "examples": [
      "deserves to be called on that"
    ]
  },
  {
    "definition": "to attract (game) by imitating the characteristic cry",
    "examples": []
  },
  {
    "definition": "to halt (something, such as a baseball game) because of unsuitable conditions",
    "examples": []
  },
  {
    "definition": "to rule on the status of (a pitched ball, a player\u0027s action, etc.)",
    "examples": [
      "call balls and strikes",
      "call a base runner safe"
    ]
  },
  {
    "definition": "to give the calls for (a square dance)",
    "examples": []
  },
  {
    "definition": "to demand payment of especially by formal notice, to demand presentation of (something, such as a bond or option) for redemption",
    "examples": [
      "call a loan",
      "The bonds could be called 10 years after issue."
    ]
  },
  {
    "definition": "to speak to or attempt to reach (someone) by means of a call (see call entry 2 sense 8), to generate signals for (a telephone number) in order to reach the party to whom the number is assigned, to make a signal to in order to transmit a message",
    "examples": [
      "call the doctor to make an appointment",
      "I try to call my parents at least once a week.",
      "He arranged for his wife, Stacey, to call him via Skype online from Kylee\u0027s fourth-grade classroom on Monday morning—a complete surprise to his daughter.",
      "— Elaine Allenemrich",
      "Call me up when you get back from your vacation.",
      "call 911",
      "call the flagship"
    ]
  },
  {
    "definition": "to speak of or address by a specified name : give a name to",
    "examples": [
      "call her Kitty"
    ]
  },
  {
    "definition": "to regard or characterize as of a certain kind : consider, to estimate or consider for purposes of an estimate or for convenience",
    "examples": [
      "can hardly be called generous",
      "call it an even dollar"
    ]
  },
  {
    "definition": "to describe correctly in advance of or without knowledge of the event : predict, to name or specify in advance",
    "examples": [
      "He called the upward trend of the stock market in February.",
      "call the toss of a coin"
    ]
  },
  {
    "definition": "to temporarily transfer control of computer processing to (something, such as a subroutine or procedure)",
    "examples": []
  },
  {
    "definition": "to call a thing by its right name however coarse",
    "examples": []
  },
  {
    "definition": "to speak frankly",
    "examples": [
      "Why don\u0027t you just call a spade a spade and say that he is a liar?"
    ]
  },
  {
    "definition": "to call (as at one\u0027s house) to get",
    "examples": [
      "I\u0027ll call for you after dinner"
    ]
  },
  {
    "definition": "to require as necessary or appropriate",
    "examples": [
      "the job calls for typing skills",
      "the design calls for three windows"
    ]
  },
  {
    "definition": "elicit, evoke",
    "examples": [
      "these events call forth great emotions"
    ]
  },
  {
    "definition": "to cast doubt upon",
    "examples": [
      "a report calling into question the drug\u0027s effectiveness"
    ]
  },
  {
    "definition": "to stop for the remainder of the day or for the present whatever one has been doing",
    "examples": [
      "worked another couple of hours and then called it a day"
    ]
  },
  {
    "definition": "to call it a day : quit",
    "examples": []
  },
  {
    "definition": "to address or speak of a person or thing contemptuously or offensively",
    "examples": []
  },
  {
    "definition": "to call upon",
    "examples": [
      "Is there anyone you can call on in an emergency?"
    ]
  },
  {
    "definition": "to elicit a response from (someone, such as a student)",
    "examples": [
      "the teacher called on her first"
    ]
  },
  {
    "definition": "to directly criticize (someone) for (something, such as bad behavior)",
    "examples": [
      "… offering ample ammunition to anyone wanting to call her on her fascination with all things violent and degrading.",
      "— Michael Upchurch"
    ]
  },
  {
    "definition": "to challenge in order to expose an empty pretense or threat",
    "examples": [
      "I called his bluff just to see if he really meant what he said.",
      "— Brandy Rankins"
    ]
  },
  {
    "definition": "to be in charge or control : determine the policy or procedure",
    "examples": [
      "The secretary called the shots all through the meeting."
    ]
  },
  {
    "definition": "to call the shots",
    "examples": []
  },
  {
    "definition": "to ask for or grant a time-out",
    "examples": []
  },
  {
    "definition": "to hold responsible : reprimand",
    "examples": [
      "He was called to account by his boss for making the error."
    ]
  },
  {
    "definition": "require, oblige",
    "examples": [
      "may be called upon to do several jobs"
    ]
  },
  {
    "definition": "to make a demand on : depend on",
    "examples": [
      "universities are called upon to produce trained professionals"
    ]
  },
  {
    "definition": "an act of calling with the voice : shout",
    "examples": [
      "a call for help"
    ]
  },
  {
    "definition": "an imitation of the cry of a bird or other animal made to attract it",
    "examples": []
  },
  {
    "definition": "an instrument used for calling",
    "examples": [
      "a duck call"
    ]
  },
  {
    "definition": "the cry of an animal (such as a bird)",
    "examples": []
  },
  {
    "definition": "a request or command to come or assemble",
    "examples": []
  },
  {
    "definition": "a summons or signal on a drum, bugle, or pipe",
    "examples": []
  },
  {
    "definition": "admission to the bar as a barrister",
    "examples": []
  },
  {
    "definition": "an invitation to become the minister of a church or to accept a professional appointment",
    "examples": []
  },
  {
    "definition": "a divine vocation or strong inner prompting to a particular course of action",
    "examples": []
  },
  {
    "definition": "a summoning of actors to rehearsal",
    "examples": [
      "the call is for 11 o\u0027clock"
    ]
  },
  {
    "definition": "the attraction or appeal of a particular activity, condition, or place",
    "examples": [
      "the call of the wild"
    ]
  },
  {
    "definition": "an order specifying the number of men to be inducted into the armed services during a specified period",
    "examples": []
  },
  {
    "definition": "the selection of a play in football",
    "examples": [
      "the quarterback\u0027s call in the huddle"
    ]
  },
  {
    "definition": "demand, claim",
    "examples": [
      "The aircraft industry continues to have first call on aluminum production.",
      "— Americana Annual"
    ]
  },
  {
    "definition": "need, justification",
    "examples": [
      "there\u0027s no call for such behavior"
    ]
  },
  {
    "definition": "a demand for payment of money",
    "examples": []
  },
  {
    "definition": "an option to buy a specified amount of a security (such as stock) or commodity (such as wheat) at a fixed price at or within a specified time — compare put sense 2",
    "examples": []
  },
  {
    "definition": "an instance of asking for something : request",
    "examples": [
      "many calls for Christmas stories"
    ]
  },
  {
    "definition": "roll call",
    "examples": []
  },
  {
    "definition": "a short usually formal visit",
    "examples": [
      "pay a call on a neighbor"
    ]
  },
  {
    "definition": "the name or thing called",
    "examples": [
      "the call was heads"
    ]
  },
  {
    "definition": "the act of calling in a card game",
    "examples": []
  },
  {
    "definition": "the act of speaking to or attempting to reach someone by telephone or by a similar online communication service",
    "examples": [
      "a telephone call",
      "a video call",
      "made a call to the mayor",
      "In a time before keeping in touch was an internet call away, I\u0027d have to say goodbye forever to bedrooms, to classrooms, to friends.",
      "— Soniah Kamal",
      "Soon after news of Bazemore\u0027s return broke, Curry shared a screenshot on Instagram of the two friends on a FaceTime call. Both were smiling, no longer thinking of what-ifs.",
      "— Wes Goldberg"
    ]
  },
  {
    "definition": "a direction or a succession of directions for a square dance rhythmically called to the dancers",
    "examples": []
  },
  {
    "definition": "a decision or ruling made by an official of a sports contest, decision sense 1",
    "examples": [
      "a tough call to make"
    ]
  },
  {
    "definition": "a temporary transfer of control of computer processing to a particular set of instructions (such as a subroutine or procedure)",
    "examples": []
  },
  {
    "definition": "available for use : at the service of",
    "examples": [
      "thousands of men at his call"
    ]
  },
  {
    "definition": "ready to respond to a summons or command",
    "examples": [
      "a doctor on call"
    ]
  },
  {
    "definition": "subject to demand for payment or return without previous notice",
    "examples": [
      "money lent at call"
    ]
  },
  {
    "definition": "within hearing or reach of a summons : subject to summons",
    "examples": []
  }
]