[
  {
    "definition": "to bring into such close relationship as to obscure individual characters : merge",
    "examples": [
      "two companies combining forces"
    ]
  },
  {
    "definition": "to cause to unite into a chemical compound",
    "examples": [
      "combining hydrofluoric acid with soda ash to form sodium fluoride"
    ]
  },
  {
    "definition": "to unite into a single number or expression",
    "examples": [
      "Combine fractions and simplify."
    ]
  },
  {
    "definition": "intermix, blend",
    "examples": [
      "Combine the sugar and flour."
    ]
  },
  {
    "definition": "to possess in combination",
    "examples": [
      "a writer whose works combine imagination and scholarship"
    ]
  },
  {
    "definition": "to become one",
    "examples": [
      "The two newspapers combined as the Chronicle."
    ]
  },
  {
    "definition": "to unite to form a chemical compound",
    "examples": []
  },
  {
    "definition": "to act together",
    "examples": [
      "Many factors combined to cause the recession.",
      "Wolves combine in their hunt for deer."
    ]
  },
  {
    "definition": "a combination especially of business or political interests",
    "examples": [
      "… Grumman Corp. lost the advanced tactical aircraft contract to the combine of McDonnell Douglas and General Dynamics.",
      "— George J. Church"
    ]
  },
  {
    "definition": "an event at which scouts from the teams in a professional sports league gather to evaluate players in preparation for choosing which players to draft",
    "examples": [
      "a scouting combine",
      "Every spring the National Football League conducts that most cherished of American rituals, the college draft. A couple of months before the event, prospective players show off their abilities in an athletic audition known as the combine.",
      "— Carl Zimmer"
    ]
  },
  {
    "definition": "a harvesting machine that heads, threshes, and cleans grain while moving over a field",
    "examples": []
  },
  {
    "definition": "to harvest with a combine",
    "examples": []
  },
  {
    "definition": "to combine a crop",
    "examples": []
  }
]