[
  {
    "definition": "a formal written warrant granting the power to perform various acts or duties",
    "examples": []
  },
  {
    "definition": "a certificate conferring military rank and authority, the rank and authority so conferred",
    "examples": [
      "received a lieutenant\u0027s commission in the army"
    ]
  },
  {
    "definition": "an authorization or command to act in a prescribed manner or to perform prescribed acts : charge",
    "examples": [
      "a commission to serve as notary public"
    ]
  },
  {
    "definition": "a formal request to produce something (especially an artistic work) in exchange for payment, a work produced by commission",
    "examples": [
      "… he found his footing as a Western artist when he received a commission in 1958 to create two … paintings …",
      "— William Grimes",
      "… the play was a commission of the Guthrie Theatre in Minneapolis …",
      "— Sharon Eberson"
    ]
  },
  {
    "definition": "authority to act for, in behalf of, or in place of another",
    "examples": [
      "… had summoned all the clans which acknowledged his commission …",
      "— T. B. Macaulay"
    ]
  },
  {
    "definition": "a task or matter entrusted to one as an agent for another",
    "examples": [
      "executed a commission for me while he was in Singapore"
    ]
  },
  {
    "definition": "a group of persons directed to perform some duty",
    "examples": [
      "The state set up a commission to study the proposed merger of the school districts."
    ]
  },
  {
    "definition": "a government agency having administrative, legislative, or judicial powers",
    "examples": [
      "regulatory powers exercised by the Federal Trade Commission"
    ]
  },
  {
    "definition": "a city council having legislative and executive functions",
    "examples": [
      "She served on the city\u0027s water commission."
    ]
  },
  {
    "definition": "an act of committing something",
    "examples": [
      "commission of a crime"
    ]
  },
  {
    "definition": "a fee paid to an agent or employee for transacting a piece of business or performing a service, a percentage of the money received from a total paid to the agent responsible for the business",
    "examples": [
      "He gets a commission for each car he sells."
    ]
  },
  {
    "definition": "an act of entrusting or giving authority",
    "examples": [
      "the commission of limited powers to the administrator"
    ]
  },
  {
    "definition": "under the authority of commissioners",
    "examples": []
  },
  {
    "definition": "ready for active service",
    "examples": []
  },
  {
    "definition": "in use or in condition for use",
    "examples": [
      "The Internet connection is back in commission."
    ]
  },
  {
    "definition": "with commission serving as partial or full pay for work done",
    "examples": [
      "an artist working on commission"
    ]
  },
  {
    "definition": "out of active service or use",
    "examples": [
      "The ferry was put out of commission because of the bad weather."
    ]
  },
  {
    "definition": "out of working order",
    "examples": [
      "The elevator was out of commission."
    ]
  },
  {
    "definition": "to furnish with a commission: such as",
    "examples": []
  },
  {
    "definition": "to confer a formal commission on",
    "examples": [
      "was commissioned lieutenant"
    ]
  },
  {
    "definition": "to appoint or assign to a task or function",
    "examples": [
      "was commissioned to do the biography"
    ]
  },
  {
    "definition": "to order to be made",
    "examples": [
      "commissioned a portrait"
    ]
  },
  {
    "definition": "to put (a ship) in commission",
    "examples": [
      "The ship was commissioned in 2004."
    ]
  }
]