[
  {
    "definition": "a coming or flowing together, meeting, or gathering at one point",
    "examples": [
      "At the confluence of Native American, Hispanic, and Anglo cultures, Santa Fe is the symbolic heart of the Southwest.",
      "— Jeffrey Steingarten",
      "A hip urban confluence of tasting rooms, galleries, and surfboard designers, it\u0027s a place where wine, art and beach culture coalesce.",
      "— Wine Enthusiast Magazine",
      "Every once in a while in pop music there is a magical confluence: the right performers doing the right music with the right support.",
      "— Ralph Novak",
      "Italian influences have marked not only the style of architecture in Passau but also the way of life. Then, of course, Eastern Europe is next door. There are many confluences, it seems.",
      "— N. Scott Momaday"
    ]
  },
  {
    "definition": "the flowing together of two or more streams",
    "examples": [
      "A complex lacework of waterways formed by the confluence of the Sacramento and San Joaquin rivers, the delta is the state\u0027s major water source …",
      "— Robert B. Gunnison",
      "Confluences are a basic building block of river networks on all scales.",
      "— Chris Paola"
    ]
  },
  {
    "definition": "the place of meeting of two streams",
    "examples": [
      "… quaint Carbondale is set at the confluence of the Crystal and Roaring Fork Rivers.",
      "— National Geographic"
    ]
  },
  {
    "definition": "the stream or body formed by the junction of two or more streams : a combined flood",
    "examples": [
      "… and eventually chose, disastrously, the only place in Assam where it was impossible for tea to thrive, being regularly drowned by the confluence of two huge rivers, a more suitable terrain for rice.",
      "— Christian Lamb"
    ]
  },
  {
    "definition": "the degree of substrate coverage that is exhibited by proliferating, adherent cells cultured in a laboratory vessel (such as a petri dish or flask), complete coverage of a culture substrate by proliferating, adherent cells",
    "examples": [
      "At days 12-14, cell confluence reached 80%.",
      "— Runguang Li et al.",
      "The measurement of cell confluency is used to determine the growth phase of cells …",
      "— Mee Foong et al.",
      "When the cells reach confluence, they form aggregates and can be serially cultured.",
      "— C. A. B. Jahoda et al.",
      "Replicate dishes of pooled cells were grown to confluency and induced with Newcastle disease virus …",
      "— Hermann Ragg and Charles Weissmann"
    ]
  }
]