[
  {
    "definition": "to move along with the body prone and close to the ground",
    "examples": [
      "A spider was creeping along the bathroom floor."
    ]
  },
  {
    "definition": "to move slowly on hands and knees",
    "examples": [
      "He crept toward the edge of the cliff."
    ]
  },
  {
    "definition": "to go very slowly",
    "examples": [
      "The hours crept by."
    ]
  },
  {
    "definition": "to go timidly or cautiously so as to escape notice",
    "examples": [
      "She crept away from the festive scene."
    ]
  },
  {
    "definition": "to enter or advance gradually so as to be almost unnoticed",
    "examples": [
      "Age creeps up on us.",
      "A note of irritation crept into her voice."
    ]
  },
  {
    "definition": "to have the sensation of being covered with creeping things",
    "examples": [
      "The thought made his flesh creep."
    ]
  },
  {
    "definition": "to spread or grow over a surface rooting at intervals or clinging with tendrils, stems, or aerial roots",
    "examples": []
  },
  {
    "definition": "to slip or gradually shift position",
    "examples": [
      "The high temperatures of the jet engine cause the turbine blade to creep."
    ]
  },
  {
    "definition": "to change shape permanently from prolonged stress or exposure to high temperatures",
    "examples": []
  },
  {
    "definition": "a movement of or like creeping",
    "examples": [
      "traffic moving at a creep"
    ]
  },
  {
    "definition": "a distressing sensation like that caused by the creeping of insects over one\u0027s flesh, a feeling of apprehension or horror",
    "examples": [
      "That gives me the creeps."
    ]
  },
  {
    "definition": "a feed trough accessible only by young animals and used especially to supply special or supplementary feed",
    "examples": []
  },
  {
    "definition": "the slow change of dimensions of an object from prolonged exposure to high temperature or stress",
    "examples": []
  },
  {
    "definition": "an unpleasant or obnoxious person",
    "examples": []
  },
  {
    "definition": "a slow but persistent increase or elevation",
    "examples": [
      "This political inertia … makes budget creep inevitable.",
      "— The Wall Street Journal"
    ]
  }
]