[
  {
    "definition": "a place (such as a wharf or platform) for the loading or unloading of materials",
    "examples": []
  },
  {
    "definition": "a usually wooden pier used as a landing place or moorage for boats",
    "examples": []
  },
  {
    "definition": "a device in which a smartphone, digital camera, etc., is placed for charging, accessing a power supply, or connecting to another electronic device",
    "examples": []
  },
  {
    "definition": "a usually artificial basin or enclosure for the reception of ships that is equipped with means for controlling the water height",
    "examples": []
  },
  {
    "definition": "slip entry 2 sense 1b",
    "examples": []
  },
  {
    "definition": "the combining site of a molecular receptor — see receptor sense b",
    "examples": [
      "Previous research showed that marijuana receptors, specialized proteins that serve as docks for THC, are clustered in regions of the brain known to play a role in movement disorders such as Huntington\u0027s disease.",
      "— Kathleen Fackelmann"
    ]
  },
  {
    "definition": "to haul or guide into or alongside a dock",
    "examples": []
  },
  {
    "definition": "to connect an electronic device (such as a computer or a digital camera) to another device",
    "examples": [
      "dock the phone into the computer"
    ]
  },
  {
    "definition": "to join (two spacecraft) mechanically while in space",
    "examples": []
  },
  {
    "definition": "to come into or alongside a dock",
    "examples": []
  },
  {
    "definition": "to become docked",
    "examples": []
  },
  {
    "definition": "to combine with a molecular receptor — see receptor sense b",
    "examples": [
      "These chemical messengers travel across a tiny cleft and dock at receptors along the surface of a muscle fiber.",
      "— Bruce A. Dobkin"
    ]
  },
  {
    "definition": "to subject to a deduction",
    "examples": [
      "dock someone\u0027s wages"
    ]
  },
  {
    "definition": "to penalize by depriving of a benefit ordinarily due, to fine by a deduction of wages",
    "examples": [
      "docked him for tardiness"
    ]
  },
  {
    "definition": "to take away a part of : abridge",
    "examples": []
  },
  {
    "definition": "to cut (part of an animal, such as the ears or a tail) short",
    "examples": []
  },
  {
    "definition": "to cut off the end of a body part of, to remove part of the tail of",
    "examples": []
  },
  {
    "definition": "the part of an animal\u0027s tail left after it has been shortened",
    "examples": []
  },
  {
    "definition": "the solid part of an animal\u0027s tail as distinguished from the hair",
    "examples": []
  },
  {
    "definition": "the place in a criminal court where a prisoner stands or sits during trial",
    "examples": []
  },
  {
    "definition": "on trial",
    "examples": []
  },
  {
    "definition": "any of a genus (Rumex) of coarse weedy plants of the buckwheat family having long taproots and sometimes used as potherbs",
    "examples": []
  },
  {
    "definition": "any of several usually broad-leaved weedy plants (as of the genus Silphium)",
    "examples": []
  }
]