[
  {
    "definition": "something used to drag (see drag entry 2) with, a device for dragging under water to detect or obtain objects",
    "examples": []
  },
  {
    "definition": "something that is dragged, pulled, or drawn along or over a surface: such as",
    "examples": []
  },
  {
    "definition": "harrow",
    "examples": []
  },
  {
    "definition": "a sledge (see sledge entry 3 sense 2) for conveying heavy bodies",
    "examples": []
  },
  {
    "definition": "conveyance",
    "examples": []
  },
  {
    "definition": "the act or an instance of dragging or drawing: such as, a drawing along or over a surface with effort or pressure, motion effected with slowness or difficulty, the condition of having or seeming to have such motion, a draw on a pipe, cigarette, or cigar, a draft (see draft entry 1 sense 2b) of liquid",
    "examples": [
      "took a drag on his cigar"
    ]
  },
  {
    "definition": "a movement, inclination, or retardation caused by or as if by dragging",
    "examples": [
      "the drag of his bottom lip"
    ]
  },
  {
    "definition": "influence securing special favor : pull",
    "examples": []
  },
  {
    "definition": "something that retards or impedes motion, action, or advancement",
    "examples": []
  },
  {
    "definition": "the retarding force acting on a body (such as an airplane) moving through a fluid (such as air) parallel and opposite to the direction of motion, friction (see friction sense 1b) between engine parts, retardation due to friction",
    "examples": []
  },
  {
    "definition": "burden, encumbrance",
    "examples": [
      "the drag of population growth on living standards"
    ]
  },
  {
    "definition": "one that is boring or gets in the way of enjoyment",
    "examples": [
      "thinks studying is a drag",
      "this sickly kid is going to be a social drag",
      "— Edmund Morris"
    ]
  },
  {
    "definition": "an object drawn over the ground to leave a scented trail",
    "examples": []
  },
  {
    "definition": "a clog (see clog entry 1 sense 1a) fastened to a trap to prevent the escape of a trapped animal",
    "examples": []
  },
  {
    "definition": "street, road",
    "examples": [
      "the main drag"
    ]
  },
  {
    "definition": "entertainment in which performers caricature or challenge gender stereotypes (as by dressing in clothing that is stereotypical of another gender, by using exaggeratedly gendered mannerisms, or by combining elements of stereotypically male and female dress) and often wear elaborate or outrageous costumes, — see also drag king, drag queen",
    "examples": [
      "\"… Atlanta … was, like, mecca for drag. It had the traditional drag queens who were female impersonators. But, you know, I had come from the punk rock side of the tracks, and we did drag as a social comment …\"",
      "— RuPaul",
      "Drag shows are events where performers impersonate characters from a certain gender and often don elaborate costuming and makeup.",
      "— Lauren Wavra",
      "The drama sparked a conversation within the LGBTQ community regarding trans, female, and nonbinary drag performers.",
      "— Xavier Piedra"
    ]
  },
  {
    "definition": "the costumes worn by drag performers, stereotypically gendered clothing worn by someone who is of a different gender, costume, a costume used to impersonate a person or kind of person",
    "examples": [
      "performing in drag",
      "… writing about her first experience using the men\u0027s toilets while in male drag …",
      "— Anna Carey",
      "What was perhaps most embarrassing about Cyrus\u0027 dismal gig was its cutesy toys—a giant teddy bear from which she popped to cavort with a dance troupe in fuzzy bear drag.",
      "— Camille Paglia",
      "… Paul Newman and Robert Redford romping about in bad-guy drag like naughty Hardy Boys ain\u0027t my idea of a western.",
      "— Mark Goodman"
    ]
  },
  {
    "definition": "drag race",
    "examples": []
  },
  {
    "definition": "to draw or pull slowly or heavily : haul, to cause to move with slowness or difficulty, to cause to trail (see trail entry 1 sense 1a) along a surface",
    "examples": [
      "dragging a box down the hall",
      "dragged myself up the stairs",
      "dragging his feet",
      "wandered off dragging the leash"
    ]
  },
  {
    "definition": "to bring by or as if by force or compulsion, to extract by or as if by pulling",
    "examples": [
      "had to drag her husband to the opera",
      "drag the truth out of him"
    ]
  },
  {
    "definition": "protract",
    "examples": [
      "drag a story out"
    ]
  },
  {
    "definition": "to pass a drag over",
    "examples": [
      "drag a field"
    ]
  },
  {
    "definition": "to explore with a drag",
    "examples": [
      "drag the pond for the drowning victim"
    ]
  },
  {
    "definition": "to catch with a dragnet (see dragnet sense 1)",
    "examples": []
  },
  {
    "definition": "to hit (a drag bunt) while moving toward first base",
    "examples": []
  },
  {
    "definition": "to select and move (an item on a computer screen) by using a mouse, a touch screen, etc.",
    "examples": [
      "drag the icon to the bottom row"
    ]
  },
  {
    "definition": "to hang or lag behind",
    "examples": [
      "Stop dragging and hurry up."
    ]
  },
  {
    "definition": "to fish or search with a drag (see drag entry 1 sense 1)",
    "examples": []
  },
  {
    "definition": "to trail along on the ground",
    "examples": [
      "Your scarf is dragging."
    ]
  },
  {
    "definition": "to move slowly because of fatigue",
    "examples": [
      "was dragging after the long trip"
    ]
  },
  {
    "definition": "to proceed or continue laboriously or tediously",
    "examples": [
      "The lawsuit dragged on for years."
    ]
  },
  {
    "definition": "draw sense 4a",
    "examples": [
      "drag on a cigarette"
    ]
  },
  {
    "definition": "to make a plucking or pulling movement",
    "examples": []
  },
  {
    "definition": "to participate in a drag race",
    "examples": []
  },
  {
    "definition": "to act in a deliberately slow or dilatory manner",
    "examples": []
  },
  {
    "definition": "of, being, involving, or intended for a person wearing clothing typical of the opposite sex : of, being, involving, or intended for a person in drag (see drag entry 1 sense 7b(1))",
    "examples": [
      "a drag ball"
    ]
  }
]