[
  {
    "definition": "labor",
    "examples": []
  },
  {
    "definition": "manual or menial work (such as the cleaning up of a camp area) performed by military personnel",
    "examples": []
  },
  {
    "definition": "the uniform or work clothing worn on fatigue and in the field",
    "examples": []
  },
  {
    "definition": "weariness or exhaustion from labor, exertion, or stress",
    "examples": [
      "We were overcome by fatigue after the long hike."
    ]
  },
  {
    "definition": "the temporary loss of power to respond that is induced in a sensory receptor (see receptor sense a) or motor (see motor entry 2 sense 1) end organ by continued stimulation",
    "examples": []
  },
  {
    "definition": "a state or attitude of indifference or apathy brought on by overexposure (as to a repeated series of similar events or appeals), — see also compassion fatigue",
    "examples": [
      "… a super PAC supporting Hillary Clinton launched within days of Barack Obama\u0027s 2013 inauguration. Voter fatigue is just one drawback to the long campaigns, though.",
      "— Martin Wisckol",
      "Most of the Romney voters they visited were fairly chipper, but there is an air of election fatigue in a state where most television commercial breaks are dominated by attack ads and the phone rings off the hook with campaign calls.",
      "— Daniel Malloy and Katie Leslie",
      "Waning media coverage of a humanitarian crisis is usually a precursor to \"donor fatigue,\" in which assistance from other nations fades.",
      "— Christian Science Monitor"
    ]
  },
  {
    "definition": "the tendency of a material to break under repeated stress",
    "examples": [
      "metal fatigue"
    ]
  },
  {
    "definition": "to weary with labor or exertion",
    "examples": []
  },
  {
    "definition": "to induce a condition of fatigue in",
    "examples": []
  },
  {
    "definition": "to suffer fatigue",
    "examples": []
  },
  {
    "definition": "consisting of, done, or used in fatigue",
    "examples": [
      "fatigue detail"
    ]
  },
  {
    "definition": "belonging to fatigues",
    "examples": [
      "a fatigue cap"
    ]
  }
]