[
  {
    "definition": "a level of study in an elementary, middle, or secondary school that is completed by a student during one year, the students in the same year of study in elementary, middle, or secondary school, a position in a scale of ranks or qualities, a stage in a process",
    "examples": [
      "will enter eleventh grade this year",
      "students in the second grade",
      "The ninth grade is away on a field trip.",
      "Each grade of steel contains sub-divisions corresponding to steels of different yield stress and impact requirements.",
      "— G. D. Taylor",
      "… we should bear in mind that animals displaying early transitional grades of the structure will seldom continue to exist to the present day, for they will have been supplanted by the very process of perfection through natural selection.",
      "— Charles Darwin"
    ]
  },
  {
    "definition": "a degree of severity in illness",
    "examples": [
      "grade III carcinoma"
    ]
  },
  {
    "definition": "a military or naval rank",
    "examples": [
      "To be prepared for burial Claggart\u0027s body was delivered to certain petty-officers of his mess. And … the Master-at-arms was committed to the sea with every funeral honor properly belonging to his naval grade.",
      "— Herman Melville",
      "… her father being a country clergyman who had never reached a higher grade than that of an archdeacon …",
      "— Anthony Trollope"
    ]
  },
  {
    "definition": "a mark indicating a degree of accomplishment in school",
    "examples": [
      "earned good grades in school",
      "What was your grade on the math test?"
    ]
  },
  {
    "definition": "a class of things of the same stage or degree",
    "examples": []
  },
  {
    "definition": "a standard of food quality",
    "examples": [
      "Extra-virgin is the highest grade of olive oil.",
      "— Lisa McManus"
    ]
  },
  {
    "definition": "the degree of inclination of a road or slope, a sloping road",
    "examples": [
      "… one track went straight up the steep hill, the other one turned square off to the right, with a very slight grade.",
      "— Mark Twain",
      "The car … toiled up the long, long grades, past Ash Fork, towards Flagstaff, where the forests and quarries are, under the dry, remote skies.",
      "— Rudyard Kipling"
    ]
  },
  {
    "definition": "a datum or reference level, ground level",
    "examples": []
  },
  {
    "definition": "a domestic animal with one parent purebred and the other of inferior breeding",
    "examples": []
  },
  {
    "definition": "any of the variants of a root or affix (distinguished by a particular vowel or the absence of any vowel) in the ablaut series of an Indo-European language",
    "examples": []
  },
  {
    "definition": "the elementary school system",
    "examples": []
  },
  {
    "definition": "to assign to a grade or assign a grade to",
    "examples": [
      "… Mrs. Granger would be the one grading their spelling tests and their reading tests …",
      "— Andrew Clements",
      "… these students are being graded by the instructor whose methods or information they have reason to question.",
      "— Mary Lefkowitz"
    ]
  },
  {
    "definition": "to arrange in grades : sort",
    "examples": [
      "Each printing plant sends sample copies of its press run to the color lab, where they are graded for quality.",
      "— Robert Neuwirth"
    ]
  },
  {
    "definition": "to arrange in a scale or series",
    "examples": []
  },
  {
    "definition": "to level off to a smooth horizontal or sloping surface",
    "examples": [
      "The ground should be graded to direct water flow away from the home.",
      "— Consumer Reports"
    ]
  },
  {
    "definition": "to form a series",
    "examples": []
  },
  {
    "definition": "blend",
    "examples": [
      "Notice that the mud and the sand grade into each other along the sandbar.",
      "— Sheldon Judson and Marvin E. Kauffman"
    ]
  },
  {
    "definition": "to be of a particular grade",
    "examples": []
  },
  {
    "definition": "being, involving, or yielding domestic animals of improved but not pure stock",
    "examples": [
      "grade ewes",
      "grade breeding"
    ]
  },
  {
    "definition": "walking",
    "examples": [
      "plantigrade"
    ]
  }
]