[
  {
    "definition": "a reversal of position, order, form, or relationship: such as, a change in normal word order, the placement of a verb before its subject, the process or result of changing or reversing the relative positions of the notes of a musical interval, chord, or phrase",
    "examples": []
  },
  {
    "definition": "the condition of being turned inward or inside out",
    "examples": []
  },
  {
    "definition": "a breaking off of a chromosome section and its subsequent reattachment in inverted position, a chromosomal section that has undergone this process",
    "examples": []
  },
  {
    "definition": "the act or process of inverting",
    "examples": []
  },
  {
    "definition": "a change in the order of the terms of a mathematical proportion effected by inverting each ratio",
    "examples": []
  },
  {
    "definition": "the operation of forming the inverse of a magnitude, a function, an operation, or an element",
    "examples": []
  },
  {
    "definition": "the conversion of dextrorotatory sucrose into a levorotatory mixture of glucose and fructose",
    "examples": []
  },
  {
    "definition": "a change from one stereochemical figuration at a chiral center in a usually organic molecule to the opposite configuration that is brought about by a reaction in which a substitution of one group is made for a different group",
    "examples": []
  },
  {
    "definition": "an increase of temperature with height through a layer of air",
    "examples": []
  },
  {
    "definition": "a corporate reorganization in which a U.S. corporation merges with or acquires a foreign corporation and restructures the U.S. corporation as a subsidiary of the newly created multinational company for the purpose of establishing a domicile in a foreign country and taking advantage of the country\u0027s corporate tax structure",
    "examples": [
      "U.S. businesses are buying foreign companies in countries with lower tax rates so they can switch their legal home and cut their tax bills. The process, known as inversion, is the hottest trend in mergers and acquisitions, driving some of the biggest takeovers this year.",
      "— Tom Fairless and Shayndi Raice"
    ]
  },
  {
    "definition": "homosexuality, identification with the gender role of the opposite sex",
    "examples": []
  }
]