[
  {
    "definition": "a food made by boiling fruit and sugar to a thick consistency",
    "examples": []
  },
  {
    "definition": "to become blocked, wedged, or stuck fast",
    "examples": [
      "The line jammed and the boat hung useless."
    ]
  },
  {
    "definition": "to become unworkable when a movable part becomes blocked or stuck",
    "examples": [
      "the gun jammed"
    ]
  },
  {
    "definition": "to force one\u0027s way into a restricted space",
    "examples": [
      "People continued to jam into the already crowded hall."
    ]
  },
  {
    "definition": "to improvise on a musical instrument with a group : to take part in a jam session",
    "examples": [
      "musicians jamming together"
    ]
  },
  {
    "definition": "dunk sense 2",
    "examples": []
  },
  {
    "definition": "to press into a close or tight position",
    "examples": [
      "jammed his hat on"
    ]
  },
  {
    "definition": "to cause to become wedged or stuck so as to be unworkable, to make (machinery) unworkable by becoming wedged or stuck",
    "examples": [
      "jam the typewriter keys",
      "The paper jammed the printer."
    ]
  },
  {
    "definition": "to block passage of : obstruct",
    "examples": [
      "traffic jammed by an accident"
    ]
  },
  {
    "definition": "to fill often to excess : pack",
    "examples": [
      "the crowd jammed the theater"
    ]
  },
  {
    "definition": "to push forcibly, to apply (brakes) suddenly and forcibly",
    "examples": [
      "jammed the shovel into the ground",
      "suddenly jammed on the brakes"
    ]
  },
  {
    "definition": "to cause (a part of the body) to be painfully crushed or squeezed",
    "examples": [
      "jammed his finger in the door"
    ]
  },
  {
    "definition": "to make unintelligible by sending out interfering signals or messages",
    "examples": [
      "jam a radio broadcast"
    ]
  },
  {
    "definition": "to make (a radar apparatus) ineffective by sending out interfering signals or by causing reflection of radar waves",
    "examples": [
      "trying to jam the enemy\u0027s radar"
    ]
  },
  {
    "definition": "to block, crowd, or bump (a pass receiver) near the line of scrimmage",
    "examples": [
      "The receiver got jammed at the line."
    ]
  },
  {
    "definition": "to pitch inside to (a batter)",
    "examples": [
      "jammed him with a fastball"
    ]
  },
  {
    "definition": "a crowded mass that impedes or blocks movement",
    "examples": [
      "a traffic jam"
    ]
  },
  {
    "definition": "an act or instance of becoming blocked or jammed (see jam entry 2)",
    "examples": [
      "paper causing a jam of the copier"
    ]
  },
  {
    "definition": "the quality or state of being blocked, stopped, or jammed",
    "examples": [
      "the jam of the legislature caused by the piling up of new bills in the final days"
    ]
  },
  {
    "definition": "the pressure or congestion of a crowd : crush",
    "examples": [
      "a jam of people"
    ]
  },
  {
    "definition": "a difficult situation or state of affairs : fix",
    "examples": [
      "got into a jam"
    ]
  },
  {
    "definition": "jam session",
    "examples": []
  },
  {
    "definition": "dunk shot",
    "examples": []
  },
  {
    "definition": "a musical piece, one that is favored or preferred over others",
    "examples": [
      "Although Rodriguez claimed to know nothing about music, he seemed certain of one thing regarding Lopez\u0027s latest jam: \"I knew it was going to be a smash the first time I heard it.\"",
      "— Abby Jones",
      "Everyone has their song—or songs—they listen to when they are doing some kind of exercise. For Carrie Underwood, though, it sounds like her jam is whatever music she\u0027s just discovered.",
      "— Alison Bonaguro"
    ]
  },
  {
    "definition": "a favorite or much-loved item, subject, interest, activity, etc.",
    "examples": [
      "We think potatoes go with pretty much everything, and these are a straightforward classic that pairs beautifully with the brightly flavored, mustardy chicken. Leave out the oregano if you don\u0027t have it or if it\u0027s not your jam.",
      "— Margaux Laskey",
      "In college, reading his [Robert F. Kennedy\u0027s] speeches—\"that was my jam,\" she [Alexandria Ocasio-Cortez] said.",
      "— David Remnick",
      "… he loves to go grocery shopping at PCC, and his oldest son introduced him recently to New Seasons Market. Cooking—especially making salmon—is his jam.",
      "— Lisa Patterson"
    ]
  },
  {
    "definition": "Jamaica",
    "examples": []
  }
]