[
  {
    "definition": "expenditure of physical or mental effort especially when difficult or compulsory",
    "examples": [
      "was sentenced to six months at hard labor"
    ]
  },
  {
    "definition": "the services performed by workers for wages as distinguished from those rendered by entrepreneurs for profits, human activity that provides the goods or services in an economy",
    "examples": [
      "Industry needs labor for production."
    ]
  },
  {
    "definition": "the physical activities (such as dilation of the cervix and contraction of the uterus) involved in giving birth, the period of such labor",
    "examples": []
  },
  {
    "definition": "an economic group comprising those who do manual labor or work for wages",
    "examples": [
      "wants the vote of labor in the elections"
    ]
  },
  {
    "definition": "the organizations or officials representing groups of workers",
    "examples": [
      "negotiations between labor and management"
    ]
  },
  {
    "definition": "workers employed in an establishment, workers available for employment",
    "examples": [
      "Immigrants provided a source of cheap labor."
    ]
  },
  {
    "definition": "the Labour party of the United Kingdom or of another part of the Commonwealth of Nations",
    "examples": []
  },
  {
    "definition": "an act or process requiring labor : task",
    "examples": [
      "The three-month project evolved into a year-long labor."
    ]
  },
  {
    "definition": "a product of labor",
    "examples": [
      "The flood destroyed the labor of years."
    ]
  },
  {
    "definition": "to exert one\u0027s powers of body or mind especially with painful or strenuous effort : work",
    "examples": []
  },
  {
    "definition": "to move with great effort",
    "examples": [
      "the truck labored up the hill"
    ]
  },
  {
    "definition": "to suffer from some disadvantage or distress",
    "examples": [
      "labor under a delusion"
    ]
  },
  {
    "definition": "to be in the labor of giving birth",
    "examples": []
  },
  {
    "definition": "to pitch or roll heavily",
    "examples": []
  },
  {
    "definition": "to treat or work out in often laborious detail",
    "examples": [
      "labor the obvious"
    ]
  },
  {
    "definition": "distress, burden",
    "examples": []
  },
  {
    "definition": "to cause to labor",
    "examples": []
  },
  {
    "definition": "to spend labor on or produce by labor",
    "examples": []
  },
  {
    "definition": "to strive to effect or achieve",
    "examples": []
  },
  {
    "definition": "of or relating to labor",
    "examples": []
  },
  {
    "definition": "of, relating to, or constituting a political party held to represent the interests of workers or made up largely of organized labor groups",
    "examples": []
  }
]