[
  {
    "definition": "a woman who has power, authority, or ownership: such as",
    "examples": []
  },
  {
    "definition": "the female head of a household",
    "examples": [
      "the mistress of the house"
    ]
  },
  {
    "definition": "a woman who employs or supervises servants",
    "examples": [
      "The servants were required to do their mistress\u0027s bidding without question."
    ]
  },
  {
    "definition": "a woman who possesses, owns, or controls something",
    "examples": [
      "the mistress of a large fortune",
      "Whether mongrels or thoroughbreds … dogs have shared their masters\u0027 and mistresses\u0027 experiences in almost all walks of life.",
      "— Robert Rosenblum"
    ]
  },
  {
    "definition": "a woman who is in charge of a school or other establishment : headmistress",
    "examples": [
      "Mrs. Goddard was the mistress of a school",
      "— Jane Austen"
    ]
  },
  {
    "definition": "a woman of the Scottish nobility having a status comparable to that of a master (see master sense 3b)",
    "examples": []
  },
  {
    "definition": "a female teacher or tutor",
    "examples": []
  },
  {
    "definition": "a woman who has achieved mastery in some field",
    "examples": [
      "She was a mistress of music.",
      "You learn how to chop throats and gouge eyes and stomp insteps … and after eight weeks you\u0027re given your diploma, which officially declares you a mistress of unarmed combat.",
      "— Arthur R. Miller"
    ]
  },
  {
    "definition": "a woman considered especially notable for something",
    "examples": [
      "After penning several apocalyptic books, she became known as the mistress of doom."
    ]
  },
  {
    "definition": "something personified as female that rules, directs, or dominates",
    "examples": [
      "… France was master of the Continent, England mistress of the seas.",
      "— James MacGregor Burns",
      "Yet he was sharp and self-interested enough (serving, that is, his demanding mistress, Painting) to write more than 400 letters …",
      "— Ronald Pickvance"
    ]
  },
  {
    "definition": "a woman other than his wife with whom a married man has a continuing sexual relationship",
    "examples": []
  },
  {
    "definition": "sweetheart",
    "examples": []
  },
  {
    "definition": "used archaically as a title prefixed to the name of a married or unmarried woman",
    "examples": []
  },
  {
    "definition": "used as a conventional title of courtesy except when usage requires the substitution of a title of rank or an honorific or professional title before a married woman\u0027s surname mrs. sense 1a",
    "examples": []
  },
  {
    "definition": "an often professional dominatrix",
    "examples": [
      "With each addition of pain or restraint, he stiffens slightly, then falls into a deeper calm, a deeper peace, waiting to obey his mistress.",
      "— Marianne Apostolides"
    ]
  }
]