[
  {
    "definition": "a shaft or pin on which something turns",
    "examples": []
  },
  {
    "definition": "a person, thing, or factor having a major or central role, function, or effect",
    "examples": []
  },
  {
    "definition": "a key player or position, an offensive position of a basketball player standing usually with back to the basket to relay passes, shoot, or provide a screen for teammates",
    "examples": []
  },
  {
    "definition": "the action of pivoting, the action in basketball of stepping with one foot while keeping the other foot at its point of contact with the floor",
    "examples": []
  },
  {
    "definition": "a usually marked change, an adjustment or modification made (as to a product, service, or strategy) in order to adapt or improve",
    "examples": [
      "The idea of allowing a [marijuana] dispensary in the city is a pivot from the stance previously held by the council, which voted in early 2018 to ban sales in the city.",
      "— Katie Sobko",
      "A global pandemic strikes a business. The adaptable owner assesses the situation, predicts the future, and starts their pivot.",
      "— Jodie Cook",
      "The company even redesigned its logo to look more like an electrical plug to emphasize its pivot to battery-powered vehicles.",
      "— Andrew J. Hawkins",
      "The debate around the use of tools to track employee productivity has grown since the pivot to remote work in 2020.",
      "— Owen Hughes",
      "The pivot to virtual learning impacted income and occupancy rates of hotels at colleges …",
      "— Melissa Angell"
    ]
  },
  {
    "definition": "turning on or as if on a pivot",
    "examples": []
  },
  {
    "definition": "pivotal",
    "examples": []
  },
  {
    "definition": "to turn on or as if on a pivot",
    "examples": [
      "a TV stand that pivots",
      "She pivoted on her heel and stalked out of the room.",
      "(figurative) The plot pivots on the discovery that Emily, who had for years been presumed dead, is found alive.",
      "— Debi Enker and Melinda Houston"
    ]
  },
  {
    "definition": "to adapt or improve by adjusting or modifying something (such as a product, service, or strategy)",
    "examples": [
      "In my first product business, I didn\u0027t know when to pivot and lost everything as a result. When your output (money) exceeds your input, or you can\u0027t afford to pay yourself, it\u0027s time to pivot.",
      "— India Gary-Martin",
      "Restauranteur Jordan Rulloda has been grinding through this pandemic. … Rulloda says he and his small team have pivoted the best they can.",
      "— Lyndsay Morrison",
      "The city famed for steel mills that powered America\u0027s industrial rise has steadily pivoted toward technology and health care …",
      "— Jonathan Lemire et al."
    ]
  },
  {
    "definition": "to provide with, mount on, or attach by a pivot",
    "examples": [
      "a pivoted mechanism"
    ]
  },
  {
    "definition": "to cause to pivot",
    "examples": [
      "pivoted the camera"
    ]
  },
  {
    "definition": "to adapt or improve by adjusting or modifying (something, such as a product, service, or strategy)",
    "examples": [
      "Pharmacies have pivoted their businesses to meet the demands of mass vaccination services …",
      "— Nick Thayer",
      "… many organizations have pivoted their operations by taking services online to adapt to current conditions and strengthen business resiliency.",
      "— Desmond Nair",
      "… sales departments have pivoted the way they\u0027re restaffing and handling sales meetings—rather than putting 100 workers back out in the field, they\u0027re deploying their teams in strategic ways and outsourcing sales until they hire again.",
      "— Zeenath Kuraisha"
    ]
  }
]