[
  {
    "definition": "having a tendency or inclination : being likely",
    "examples": [
      "prone to forget names",
      "His relatives are prone to heart disease.",
      "Those batteries are prone to corrosion.",
      "a process that\u0027s prone to error",
      "… a great quarterback prone to the occasional, inevitable mistake.",
      "— John McGrath",
      "This means the results should be interpreted cautiously, as smaller sample sizes are prone to being influenced by chance.",
      "— nhs.uk",
      "accident-prone",
      "a drought-prone region"
    ]
  },
  {
    "definition": "having the front or ventral surface of a body facing downward : lying with the chest and stomach positioned downward",
    "examples": [
      "a patient placed in a prone position",
      "The victim was lying prone in the street."
    ]
  },
  {
    "definition": "lying flat or prostrate",
    "examples": [
      "prone stems"
    ]
  },
  {
    "definition": "to place (oneself or another person) in a prone position with the chest and stomach facing downward especially to increase blood oxygenation, — see also proning entry 1",
    "examples": [
      "Ventilated patients are typically proned for 16 hours, but at Mass General, Dr. [C. Corey] Hardin said, some are proned for 24 or 48 hours.",
      "— Pam Belluck",
      "If patients are alert, they can turn, or prone, themselves every couple hours. If they\u0027re ventilated, it could take a team of up to half a dozen health care workers 20 minutes to carefully prone a patient, who might then stay on their stomach for up to 24 hours.",
      "— Mallory Moench"
    ]
  },
  {
    "definition": "to cause or order (a person) to lie flat on the ground with the face and stomach facing downward",
    "examples": [
      "They were proned and handcuffed.",
      "He was ordered to prone himself.",
      "… [Sergeant Jeremy] Glass said handcuffing in the prone position is the method that is taught under the state\u0027s Basic Law Enforcement Training standards. …\"Subjects end up being proned out in about 60% of physical force encounters …,\" Glass said.",
      "— John Henderson",
      "Humboldt County Sheriff\u0027s Office Lt. Steve Knight said deputies found the man …. Two deputies drew their firearms and \"proned him out at gunpoint,\" Knight said … .",
      "— Luke Ramseth"
    ]
  },
  {
    "definition": "to lie flat on one\u0027s stomach on the ground",
    "examples": [
      "He immediately proned out when told to do so."
    ]
  }
]