[
  {
    "definition": "a flat structure (as of wood) for support or transportation on water, an inflatable flat-bottomed watercraft",
    "examples": [
      "\"How shall we cross the river?\" asked Dorothy. \"That is easily done,\" replied the Scarecrow. \"The Tin Woodman must build us a raft, so we can float to the other side.\" So the Woodman took his axe and began to chop down small trees to make a raft …",
      "— L. Frank Baum",
      "… has made a living poling a raft on the Suchiate for two decades …",
      "— María Verza and Sonia Pérez",
      "In addition to a gorgeous 400\u0027 long sandy beach with a swim raft, there are 44 boat docks which are licensed to individual … homeowners.",
      "— Frank Roche",
      "Finally, the three astronauts, wearing their isolation garments, clambered out of the spacecraft into a rubber raft.",
      "— Brian Duff",
      "All my fishing gear, which sometimes included an inflatable raft, went into a backpack so that my hands would be free to carry my shotgun.",
      "— Nelson Bryant"
    ]
  },
  {
    "definition": "a collection of logs or timber fastened together in order to be floated downstream (as to a sawmill)",
    "examples": [
      "Soviet loggers commonly float individual logs down rivers to sawmills, rather than lashing them together in rafts.",
      "— A. Kent MacDougall"
    ]
  },
  {
    "definition": "a floating naturally cohesive mass",
    "examples": [
      "rafts of kelp",
      "Home sites and hunting vantage points would have been undercut by the waves, salt meadows would have become angry shallow seas, and bitter salt and rafts of sea ice would have killed the willow brush and rich sedge meadows of the river deltas.",
      "— William W. Fitzburg and Aron Crowell"
    ]
  },
  {
    "definition": "an aggregation of animals (such as waterfowl) resting on the water",
    "examples": [
      "a raft of ducks"
    ]
  },
  {
    "definition": "to transport by means of a raft (see raft entry 1 sense 1a)",
    "examples": [
      "Lewis was rafting supplies cross river … when he dumped his raft, soaking his chronometer.",
      "— Fred Haefele"
    ]
  },
  {
    "definition": "to transport in the form of a raft (see raft entry 1 sense 1b)",
    "examples": [
      "… the logs which had been floating in them were swept down the river to the sea before being rafted away to the sawmills.",
      "— D. A. Bathgate"
    ]
  },
  {
    "definition": "to convey (something, such as pebbles) in floating ice or masses of organic material",
    "examples": [
      "… sediment deposits are dominated by rock fragments released by melting ice. Even large rocks are rafted out and then released as the ice melts.",
      "— M. Grant Gross"
    ]
  },
  {
    "definition": "to travel along or across (a river or other body of water) on a raft",
    "examples": [
      "Although the writing is somewhat pedestrian, river rats will enjoy the 27 accounts … of rafting rivers in 11 Western states.",
      "— Tom Miller"
    ]
  },
  {
    "definition": "to make into a raft",
    "examples": [
      "rafted the logs"
    ]
  },
  {
    "definition": "to travel by raft",
    "examples": [
      "rafted across moderate rapids"
    ]
  },
  {
    "definition": "a large collection or number",
    "examples": []
  }
]