[
  {
    "definition": "a formal decree, an ecclesiastical decree",
    "examples": []
  },
  {
    "definition": "a solemn agreement : oath",
    "examples": []
  },
  {
    "definition": "something that makes an oath binding",
    "examples": []
  },
  {
    "definition": "the detriment, loss of reward, or coercive intervention annexed to a violation of a law as a means of enforcing the law",
    "examples": []
  },
  {
    "definition": "a consideration, principle, or influence (as of conscience) that impels to moral action or determines moral judgment",
    "examples": []
  },
  {
    "definition": "a mechanism of social control for enforcing a society\u0027s standards",
    "examples": []
  },
  {
    "definition": "explicit or official approval, permission, or ratification : approbation",
    "examples": []
  },
  {
    "definition": "an economic or military coercive measure adopted usually by several nations in concert for forcing a nation violating international law to desist or yield to adjudication",
    "examples": []
  },
  {
    "definition": "to make valid or binding usually by a formal procedure (such as ratification)",
    "examples": []
  },
  {
    "definition": "to give effective or authoritative approval or consent to",
    "examples": [
      "… such characters … look, talk, and act in ways sanctioned by society and novelistic tradition …",
      "— Lawrence Chua"
    ]
  },
  {
    "definition": "to attach a sanction or penalty to the violation of (a right, obligation, or command)",
    "examples": [
      "… the status, procedures, rights, and duties of members are carefully defined by rules that are sanctioned by fines should they be contravened by members.",
      "— Malcolm Ruel"
    ]
  },
  {
    "definition": "to impose a sanction or penalty upon",
    "examples": [
      "… a Long Island brokerage firm that, at the time, had serious Securities and Exchange Commission, or SEC fraud charges pending against it and has since been heavily fined and sanctioned.",
      "— Molly Ivins"
    ]
  }
]