[
  {
    "definition": "marked by eager hopefulness : confidently optimistic",
    "examples": [
      "In the month of August 1994, Democrats remained sanguine about their chances at the polls …",
      "— John B. Judis",
      "A lot of attention also is being devoted to the development of vaccines to prevent genital herpes, although not everyone is sanguine about the outcome.",
      "— The Journal of the American Medical Association"
    ]
  },
  {
    "definition": "bloodred",
    "examples": [
      "… the radiant heat from the cedar logs, whose sanguine colour made the silvered locks of his hair into a fantastic wreath of flames.",
      "— Elinor Wylie"
    ]
  },
  {
    "definition": "consisting of or relating to blood",
    "examples": [
      "… some sanguine vessels are obstructed, and distended …",
      "— Theophilus Lobb"
    ]
  },
  {
    "definition": "bloodthirsty, sanguinary",
    "examples": [
      "… attacked by the sanguine … warriors of neighboring islands …",
      "— Ana Y. Ramos-Zayas"
    ]
  },
  {
    "definition": "accompanied by, involving, or relating to bloodshed : bloody",
    "examples": [
      "… from the numerous graves, including those by the barn, which our shells had destroyed; we realized what a sanguine battle it had been …",
      "— Frederick W. Wild"
    ]
  },
  {
    "definition": "ruddy",
    "examples": [
      "She was all unnerved; her naturally sanguine complexion was pale …",
      "— Charlotte Brontë"
    ]
  },
  {
    "definition": "having blood as the predominating bodily humor — see humor entry 1 sense 2c, having the bodily conformation and temperament held characteristic of such predominance and marked by sturdiness, healthy red complexion, and cheerfulness",
    "examples": [
      "An abundance of red blood was marked by a warm and sanguine temperament; whereas, an excess of yellow bile produced the choleric temperament …",
      "— Samuel Lytler Metcalfe",
      "He conceived himself rather as a sanguine and strenuous man, a great fighter.",
      "— G. K. Chesterton"
    ]
  },
  {
    "definition": "a moderate to strong red",
    "examples": []
  }
]