[
  {
    "definition": "intention, object",
    "examples": []
  },
  {
    "definition": "space or opportunity for unhampered motion, activity, or thought",
    "examples": []
  },
  {
    "definition": "extent of treatment, activity, or influence",
    "examples": []
  },
  {
    "definition": "range of operation: such as",
    "examples": []
  },
  {
    "definition": "the range of a logical operator : a string in predicate calculus that is governed by a quantifier",
    "examples": []
  },
  {
    "definition": "a grammatical constituent that determines the interpretation of a predicate or quantifier",
    "examples": []
  },
  {
    "definition": "any of various instruments for viewing: such as",
    "examples": []
  },
  {
    "definition": "microscope",
    "examples": []
  },
  {
    "definition": "telescope",
    "examples": []
  },
  {
    "definition": "a telescope mounted on a firearm for use as a sight",
    "examples": []
  },
  {
    "definition": "endoscope",
    "examples": []
  },
  {
    "definition": "horoscope",
    "examples": []
  },
  {
    "definition": "to look at especially for the purpose of evaluation",
    "examples": [
      "Eunice and I … strutted down the aisles, pretending we were looking for somewhere to sit. Really we were just scoping the place out to see who was there.",
      "— Helene Cooper",
      "Wherever you go, scope out the situation carefully before you take off your dog\u0027s leash.",
      "— Donna-Lynn Musgrave",
      "It abuts Wagner Park, where at twilight people watch softball and scope out the local talent.",
      "— Rob Spillman"
    ]
  },
  {
    "definition": "to view (something) with a telescope",
    "examples": [
      "… atop a small hill that once held a mortar battery, two urban park rangers and twenty-five or so shivering visitors scoped the sky.",
      "— Ian Frazier",
      "If scoping the stars isn\u0027t your thing, the ship also offers a rich array of on-board speakers, wine tastings, golf simulations and a casino to keep you busy.",
      "— The Plainsman (Auburn University, Alabama)"
    ]
  },
  {
    "definition": "to examine with an endoscope and especially an arthroscope",
    "examples": [
      "Players on every pro team have been scoped, mostly their knees (about 80%) but also their shoulders, elbows, wrists.",
      "— Kostya Kennedy",
      "He went to the hospital with the thought that the knee would be scoped, a simple procedure, and he would be back in the lineup in about 10 days.",
      "— Leigh Montville"
    ]
  },
  {
    "definition": "to equip with a scope",
    "examples": [
      "a scoped rifle"
    ]
  },
  {
    "definition": "means (such as an instrument) for viewing or observing",
    "examples": [
      "endoscope",
      "spectroscope"
    ]
  }
]