[
  {
    "definition": "to cause (someone) to experience a strong feeling of enjoyable excitement, — see also thrilled, thrilling",
    "examples": [
      "The news thrilled him.",
      "a performance that thrilled the crowd",
      "It\u0027s just one of the 35 breathtaking stunts the 47-year-old daredevil pilot uses to thrill spectators at airshows across the country.",
      "— Jean Bryant"
    ]
  },
  {
    "definition": "to experience a surge of excitement and pleasure",
    "examples": [
      "They thrilled to the sound of his voice.",
      "She remembers that her father thrilled to see his daughter\u0027s name in print …",
      "— David Ansen",
      "From the beginning, Americans thrilled to the Hubble\u0027s potential to do dramatic science, to take us intellectually where no one has gone before.",
      "— Chet Raymo",
      "Kit thrilled at the sight of the familiar red coats.",
      "— Elizabeth George Speare"
    ]
  },
  {
    "definition": "to move or pass so as to cause a sudden wave of emotion",
    "examples": [
      "… a faint cold fear thrills through my veins …",
      "— William Shakespeare"
    ]
  },
  {
    "definition": "tremble entry 1, vibrate",
    "examples": [
      "… the very rocks seem to thrill with life.",
      "— John Muir"
    ]
  },
  {
    "definition": "a feeling of great excitement or happiness",
    "examples": [
      "The thrill isn\u0027t gone from our marriage after all this time.",
      "the thrill of discovery/victory",
      "\"The most fun thing I\u0027ve done so far,\" [Dorothy] Parke reports, \"is put my foot through a window. It was only breakaway glass; but it was my first stunt, and it gave me such a thrill.\"",
      "— Paul Francis"
    ]
  },
  {
    "definition": "a tingling of or as if of the nerves produced by a sudden emotional reaction",
    "examples": [
      "a thrill of horror",
      "a thrill of pride/pleasure/anticipation",
      "Harry felt a thrill of dread: He was about to pay for what had just happened, he was sure of it.",
      "— J. K. Rowling"
    ]
  },
  {
    "definition": "a very exciting or enjoyable event or experience",
    "examples": [
      "What a thrill it was to see the Queen!",
      "a movie with a lot of thrills and chills [\u003dexciting and frightening parts]",
      "the thrills and spills of skateboarding",
      "He had always fancied himself as having a fine voice, and now to hear it from his wife\u0027s own lips was a real thrill.",
      "— E. B. White"
    ]
  }
]