[
  {
    "definition": "a violent or forceful flow of fluid, a rushing stream of water",
    "examples": [
      "Terrifying video captured near Hawaii volcano Kilauea shows a torrent of lava violently flowing down the slopes of the erupting mount …",
      "— Aurora Bosotti",
      "Beneath the area\u0027s dense canopy of vegetation, rugged hills and valleys are bisected by streams that rage as torrents during the rainy season, forbidding terrain for any unwelcome stranger.",
      "— Anthony Loyd",
      "… the vast network of storm-water drains that move great torrents of water out of the city when it rains …",
      "— Duncan Murrell",
      "As church bells pealed yesterday, a torrent of water was unleashed through a manmade gap in the 162-year-old Edwards Dam in the first U.S. government-ordered demolition of a dam in the name of conservation.",
      "— Glen Adams"
    ]
  },
  {
    "definition": "a heavy downpour of rain",
    "examples": [
      "… a torrent of rain poured down.",
      "— Walter Farley",
      "The rain is coming down in torrents. Lightning is flashing.",
      "— Alice Walker",
      "Torrents of rain drenched the Hamptons …",
      "— Chris Mundy"
    ]
  },
  {
    "definition": "a tumultuous outpouring : rush",
    "examples": [
      "Injuries, a 13-game losing streak and a torrent of criticism have turned this into the toughest season of Vince Carter\u0027s four-year career.",
      "— Ian Thomsen",
      "The torrent of money flowing into the field can only be described in superlatives—hundreds of millions of dollars for efforts such as Princeton\u0027s Center for the Study of Brain, Mind, and Behavior and MIT\u0027s McGovern Institute for Brain Research.",
      "— Charles Barber",
      "… torrents of unsolicited e-mail advertising …",
      "— Peter H. Lewis",
      "… once he becomes fixed on a subject, the words come in torrents.",
      "— Jeffrey Goldberg"
    ]
  },
  {
    "definition": "a channel of a mountain stream",
    "examples": [
      "As we advanced up the valley, the road presented yet another vertiginous challenge. Being a single track carved out of the mountain wall that flanked a glacial torrent, it meant that when a car came from the opposite direction, one had to back to the nearest turnaround.",
      "— June P. Wilson"
    ]
  },
  {
    "definition": "a protocol (see protocol sense 3b) that is used to distribute a large computer file (such as of digitized music or video) that has been segmented in small pieces between a large number of peer-to-peer users, a file or set of files that is transferred with this protocol",
    "examples": [
      "… user behaviour, such as use of file-sharing services and protocols like torrent …",
      "— Shelley Boose",
      "Over the weekend, several ISPs … began showing a warning to users when they visited certain torrent or other file-sharing websites.",
      "— Rajat Agrawal",
      "Let me just share the best way I know how to download torrents without setting off any red flags.",
      "— Daniel Bulygin",
      "Torrent files have been a top choice of users across the internet to share files for almost two decades.",
      "— Ivan Mehta"
    ]
  },
  {
    "definition": "to move in a torrent (see torrent entry 1 sense 1a)",
    "examples": [
      "rivers of torrenting water",
      "Water torrents off hillsides, thunders over falls, sparkles in ponds and pools.",
      "— Sunset"
    ]
  },
  {
    "definition": "to download via a torrent (see torrent entry 1 sense 4)",
    "examples": [
      "Torrenting itself isn\u0027t illegal, but downloading unsanctioned copyrighted material is. It\u0027s not always immediately apparent which content is legal to torrent and which isn\u0027t.",
      "— Paul Bischoff",
      "[Dan] Schlosser said that when he was caught torrenting, the University forwarded him a notice of copyright infringement from HBO and warned that if he were caught again, he would have to meet with a representative from the Office of Judicial Affairs.",
      "— Aaron Fisher"
    ]
  },
  {
    "definition": "torrential",
    "examples": []
  }
]