[
  {
    "definition": "a dividing ridge between drainage areas : divide entry 2",
    "examples": [
      "The watershed of the Himalayas does not lie along the line of its highest peaks, as in most mountain ranges, but about a hundred miles farther north.",
      "— Frits Staal"
    ]
  },
  {
    "definition": "a region or area bounded peripherally by a divide and draining ultimately to a particular watercourse or body of water",
    "examples": [
      "the Mississippi River watershed"
    ]
  },
  {
    "definition": "a crucial dividing point, line, or factor : turning point",
    "examples": [
      "This year marked a watershed for contemporary classical music in the city.",
      "— The Chicago Tribune",
      "The spring of 1949 was, in general, a watershed in Joe Liebling\u0027s life.",
      "— Raymond Sokolov",
      "The death of Ugandan teacher Gregory Byaruhanga at the hands of the Kenyan police has marked a watershed in the rising tension in the region and in the instability of the Kenyan regime.",
      "— Victoria Brittain",
      "a watershed moment",
      "a watershed event",
      "The watershed year for science fiction must be 1968, when Stanley Kubrick\u0027s 2001: A Space Odyssey appeared, not only dramatically expanding for this kind of motion picture the potentials of film technology, but making science fiction a vehicle for both poetic vision and metaphysical exploration.",
      "— Ira Konigsberg"
    ]
  },
  {
    "definition": "the time of day after which television programs not appropriate for children may be broadcast",
    "examples": [
      "the nine o\u0027clock watershed"
    ]
  },
  {
    "definition": "an area of tissue (as of the brain or colon) that is located at the periphery of two separate arterial systems, is dependent on both for blood supply, and may be poorly perfused and vulnerable to ischemia, — see also watershed infarction",
    "examples": [
      "Brain imaging of patients with vascular dementia typically show small strokes or poor blood supply deep in the brain, at the natural terminal (the so-called watershed area) of the blood vessel.",
      "— Renee Meyer",
      "… cell death caused by blocked blood flow in the brain\u0027s \"watershed\" region, where two arteries supply blood.",
      "— Susan Scutti"
    ]
  }
]